In [1]:
import pandas as pd
from urllib.request import urlretrieve

In [2]:
italy_covid_url = 'https://gist.githubusercontent.com/aakashns/f6a004fa20c84fec53262f9a8bfee775/raw/f309558b1cf5103424cef58e2ecb8704dcd4d74c/italy-covid-daywise.csv'

urlretrieve(italy_covid_url, 'italy-covid-daywise.csv')

('italy-covid-daywise.csv', <http.client.HTTPMessage at 0x2322158a7c8>)

In [3]:
data = pd.read_csv(
    'italy-covid-daywise.csv',
    dtype={
        'date': 'object',
        'new_cases': 'float32',
        'new_deaths': 'float32',
        'new_tests': 'float32'
    }
)

#Specifying dtype would reduce the memory usage

#### Below you can observe the significant drop in memory usage when dtype is specified

In [4]:
pd.read_csv(
    'italy-covid-daywise.csv',
    dtype={
        'date': 'object',
        'new_cases': 'float16',
        'new_deaths': 'float16',
        'new_tests': 'float16'
    }
).memory_usage(deep=True)

Index           128
date          16616
new_cases       496
new_deaths      496
new_tests       496
dtype: int64

In [5]:
pd.read_csv(
    'italy-covid-daywise.csv',
).memory_usage(deep=True)

Index           128
date          16616
new_cases      1984
new_deaths     1984
new_tests      1984
dtype: int64

In [6]:
data.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

In [7]:
data.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float32
 2   new_deaths  248 non-null    float32
 3   new_tests   135 non-null    float32
dtypes: float32(3), object(1)
memory usage: 5.0+ KB

In [8]:
# Set the number of max columns or rows to be displayed

pd.options.display.max_columns = 10

In [9]:
data.memory_usage(deep=True)

Index           128
date          16616
new_cases       992
new_deaths      992
new_tests       992
dtype: int64

In [10]:
# Returns descriptive statistics of the data

data.describe(include='all')

              date    new_cases  new_deaths     new_tests
count          248   248.000000  248.000000    135.000000
unique         248          NaN         NaN           NaN
top     2019-12-31          NaN         NaN           NaN
freq             1          NaN         NaN           NaN
mean           NaN  1094.818604  143.133072  31699.673828
std            NaN  1554.508057  227.105545  11622.209961
min            NaN  -148.000000  -31.000000   7841.000000
25%            NaN   123.000000    3.000000  25259.000000
50%            NaN   342.000000   17.000000  29545.000000
75%            NaN  1371.750000  175.250000  37711.000000
max            NaN  6557.000000  971.000000  95273.000000

In [11]:
# Return 5 records at random

data.sample(5)

           date  new_cases  new_deaths  new_tests
5    2020-01-05        0.0         0.0        NaN
177  2020-06-25      577.0       -31.0    29421.0
211  2020-07-29      202.0        11.0    30875.0
112  2020-04-21     2256.0       454.0    28095.0
115  2020-04-24     2646.0       464.0    95273.0

### Indexing data using `loc`, `iloc` and `at`

### Using `loc` we can access data by referencing to explict index and using `iloc` we can access data by referencing to implicit index

In [12]:
data.at[147, 'new_cases']

300.0

In [13]:
data.loc[147, :]

date          2020-05-26
new_cases          300.0
new_deaths          92.0
new_tests        33944.0
Name: 147, dtype: object

In [14]:
data.iloc[147, :]

date          2020-05-26
new_cases          300.0
new_deaths          92.0
new_tests        33944.0
Name: 147, dtype: object

#### Above we were able to use 147 for `loc` as well as `iloc` because there the index/label and integer position was equal to 144

In [15]:
new_data = data.sample(5).copy()
new_data

           date  new_cases  new_deaths  new_tests
209  2020-07-27      254.0         5.0    19374.0
118  2020-04-27     2324.0       260.0    26678.0
88   2020-03-28     5959.0       971.0        NaN
225  2020-08-12      412.0         6.0    27330.0
23   2020-01-23        0.0         0.0        NaN

In [16]:
new_data.index

Int64Index([209, 118, 88, 225, 23], dtype='int64')

In [17]:
# We change index/label, so we will have to specify different values for loc and iloc

new_data.index = ['a', 'b', 'c', 'd', 'e']

In [18]:
new_data

         date  new_cases  new_deaths  new_tests
a  2020-07-27      254.0         5.0    19374.0
b  2020-04-27     2324.0       260.0    26678.0
c  2020-03-28     5959.0       971.0        NaN
d  2020-08-12      412.0         6.0    27330.0
e  2020-01-23        0.0         0.0        NaN

#### `dataframe.loc['row_label', 'column_label']`

In [19]:
new_data.loc['a', :] # here `a` is explicit index

date          2020-07-27
new_cases          254.0
new_deaths           5.0
new_tests        19374.0
Name: a, dtype: object

#### `dataframe.iloc['integer_position_of_row', 'integer_position_of_column']`

In [20]:
new_data.iloc[0, 0] # here 0 is implicit index

'2020-07-27'

#### `dataframe.at['row_label', 'column_label']`

In [21]:
new_data.at['a', 'new_cases']

254.0

In [22]:
new_data.head()

         date  new_cases  new_deaths  new_tests
a  2020-07-27      254.0         5.0    19374.0
b  2020-04-27     2324.0       260.0    26678.0
c  2020-03-28     5959.0       971.0        NaN
d  2020-08-12      412.0         6.0    27330.0
e  2020-01-23        0.0         0.0        NaN

In [23]:
# Filter data and few columns without using `dataframe.loc`

data[data.new_cases>250][['new_cases', 'new_deaths']]

     new_cases  new_deaths
62       561.0         6.0
63       347.0        17.0
64       466.0        28.0
65       587.0        27.0
66       769.0        41.0
..         ...         ...
243     1444.0         1.0
244     1365.0         4.0
245      996.0         6.0
246      975.0         8.0
247     1326.0         6.0

[147 rows x 2 columns]

In [24]:
# Filter data and few columns using `dataframe.loc`

data.loc[data.new_cases>250, ['new_cases', 'new_deaths']]

     new_cases  new_deaths
62       561.0         6.0
63       347.0        17.0
64       466.0        28.0
65       587.0        27.0
66       769.0        41.0
..         ...         ...
243     1444.0         1.0
244     1365.0         4.0
245      996.0         6.0
246      975.0         8.0
247     1326.0         6.0

[147 rows x 2 columns]

In [25]:
# Check sum of null values across columns

data.isnull().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [26]:
data_new = data.copy()

In [27]:
data_new.isnull().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [28]:
data_new[data_new['new_tests'].isnull()]

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
108  2020-04-17     3786.0       525.0        NaN
109  2020-04-18     3493.0       575.0        NaN
110  2020-04-19     3491.0       480.0        NaN
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[113 rows x 4 columns]

In [29]:
# Here we are filling it with -1, but we can fill it with mean or something else as well

data_new.fillna(-1, inplace=True)

In [30]:
data_new[data_new.new_tests.isnull()]

Empty DataFrame
Columns: [date, new_cases, new_deaths, new_tests]
Index: []

In [31]:
# Count of unique values across coulmns

data.nunique()

date          248
new_cases     188
new_deaths    129
new_tests     135
dtype: int64

In [32]:
# Lists all unique values in a column

data.new_tests.unique()

array([   nan,  7841., 28095., 44248., 37083., 95273., 38676., 24113.,
       26678., 37554., 38589., 41441., 43732., 31231., 27047., 22999.,
       32211., 37771., 13665., 45428., 36091., 31384., 25823., 39620.,
       37049., 41131., 39027., 40657., 33505., 26101., 40226., 38617.,
       40644., 42987., 42579., 34206., 20676., 33944., 37299., 39838.,
       38233., 36051., 28948., 18053., 25628., 20035., 27451., 40470.,
       34036., 27894., 16301., 32200., 37865., 32991., 37651., 32880.,
       29545., 17463., 27762., 33957., 32921., 28570., 29875., 24581.,
       16152., 23225., 30237., 29421., 28331., 29721., 21183., 15484.,
       28471., 29325., 29147., 25680., 28946., 21166., 13771., 22490.,
       28679., 29947., 27251., 25449., 23061., 14006., 24222., 28392.,
       28089., 28661., 27569., 20621., 14121., 23915., 29288., 33018.,
       28970., 28059., 25177., 19374., 25341., 30875., 33396., 29686.,
       31905., 24496., 13467., 23491., 29739., 32169., 30392., 26631.,
       22773., 10904., 22063., 27330., 25629., 24868., 25937., 22470.,
       21379., 32687., 41290., 49662., 44943., 46613., 47463., 33358.,
       45798., 58054., 57640., 65135., 64294., 53541., 42583., 54395.],
      dtype=float32)

In [33]:
# Counts the occurence of values in a column

data.new_tests.value_counts()

7841.0     1
24222.0    1
25341.0    1
19374.0    1
25177.0    1
          ..
38233.0    1
39838.0    1
37299.0    1
33944.0    1
54395.0    1
Name: new_tests, Length: 135, dtype: int64

In [34]:
d = {
    'A': [1, 2, 3, 4, 5, 6, 1, 2, 3, 4],
    'City': ['Pune', 'Mumbai', 'Mumbai', 'Delhi', 'Bangalore', 'Pune', 'Mumbai', 'Mumbai', 'Delhi', 'Goa'],
    'B' :['A', 'B', 'C', 'W', 'P', 'A', 'O', 'Q', 'E', 'V']
}

In [35]:
dummy_data = pd.DataFrame(d)

In [36]:
dummy_data

   A       City  B
0  1       Pune  A
1  2     Mumbai  B
2  3     Mumbai  C
3  4      Delhi  W
4  5  Bangalore  P
5  6       Pune  A
6  1     Mumbai  O
7  2     Mumbai  Q
8  3      Delhi  E
9  4        Goa  V

### To find records which have city that occurs more than once - `'Mumbai', 'Pune', 'Delhi'`

In [37]:
a = dummy_data.City.value_counts() 
city_constraint_list = a[a > 1].index
city_constraint_list

Index(['Mumbai', 'Pune', 'Delhi'], dtype='object')

In [38]:
dummy_data[dummy_data.City.isin(city_constraint_list)]

   A    City  B
0  1    Pune  A
1  2  Mumbai  B
2  3  Mumbai  C
3  4   Delhi  W
5  6    Pune  A
6  1  Mumbai  O
7  2  Mumbai  Q
8  3   Delhi  E

In [39]:
dummy_data[dummy_data.groupby('City')['A'].transform('count')>1]

   A    City  B
0  1    Pune  A
1  2  Mumbai  B
2  3  Mumbai  C
3  4   Delhi  W
5  6    Pune  A
6  1  Mumbai  O
7  2  Mumbai  Q
8  3   Delhi  E

In [40]:
import requests

In [41]:
url = "https://github.com/chris1610/pbpython/blob/master/data/sales_transactions.xlsx?raw=true"

In [42]:
sales_data = pd.read_excel(url)

In [43]:
sales_data.head()

   account           name  order       sku  quantity  unit price  ext price
0   383080       Will LLC  10001  B1-20000         7       33.69     235.83
1   383080       Will LLC  10001  S1-27722        11       21.12     232.32
2   383080       Will LLC  10001  B1-86481         3       35.99     107.97
3   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
4   412290  Jerde-Hilpert  10005  S1-82801        21       13.62     286.02

In [44]:
order_data = sales_data.groupby('order')['ext price'].sum().rename('total').reset_index()

In [45]:
order_data

   order    total
0  10001   576.12
1  10005  8185.49
2  10006  3724.49

In [46]:
new_df_merged = sales_data.merge(order_data)

In [47]:
new_df_merged

,account,name,order,sku,quantity,unit price,ext price,total
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,8185.49
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,8185.49
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,8185.49
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,3724.49
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,3724.49
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,3724.49
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,3724.49

In [48]:
new_df_merged['percent'] = new_df_merged['ext price'] / new_df_merged['total']

In [49]:
new_df_merged

,account,name,order,sku,quantity,unit price,ext price,total,percent
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12,0.409342
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12,0.403249
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12,0.187409
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49,0.327330
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49,0.034942
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,8185.49,0.101759
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,8185.49,0.424170
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,8185.49,0.111798
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,3724.49,0.821890
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,3724.49,0.139254
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,3724.49,0.058236
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,3724.49,-0.019380

In [50]:
order_data

   order    total
0  10001   576.12
1  10005  8185.49
2  10006  3724.49

In [51]:
sales_data.join(order_data, on='order', how='left', lsuffix='_l', rsuffix='_r')

,account,name,order_l,sku,quantity,unit price,ext price,order_r,total
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,NaN,NaN
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,NaN,NaN
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,NaN,NaN
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,NaN,NaN
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,NaN,NaN
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,NaN,NaN
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,NaN,NaN
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,NaN,NaN
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,NaN,NaN
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,NaN,NaN
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,NaN,NaN
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,NaN,NaN

In [52]:
sales_data.merge(order_data, on='order', how='inner', suffixes=('_l', '_r'))

,account,name,order,sku,quantity,unit price,ext price,total
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,8185.49
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,8185.49
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,8185.49
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,3724.49
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,3724.49
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,3724.49
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,3724.49

## Merge and Join in Pandas

In [53]:
user_usage = pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_usage.csv')
android_devices = pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/android_devices.csv')
user_device = pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_device.csv')

In [54]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [55]:
android_devices.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [56]:
android_devices.Model.value_counts()

LG-P970               23
LG-P920               20
LG-P990               20
LG-E510               19
LG-P690               14
                      ..
Thunder 347            1
KAZAM Thunder 350L     1
KAZAM Thunder 550      1
KAZAM Thunder 550L     1
EASY1                  1
Name: Model, Length: 12883, dtype: int64

In [57]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [58]:
user_device.device.value_counts()

SM-G900F                  32
iPhone7,2                 27
iPhone6,2                 22
GT-I9505                  13
ONEPLUS A3003              9
                          ..
Nexus 5                    1
HTC Desire 530             1
E6653                      1
D5803                      1
Vodafone Smart ultra 6     1
Name: device, Length: 72, dtype: int64

`user_device` and `user_usage` can be merged on `use_id` column, `user_device` and `android_devices` can be merged on `Model` and `device` column as these 2 columns hold similar values

**Problem Statement** - We would like to determine if the usage patterns for users differ between different devices. For example, do users using Samsung devices use more call minutes than those using  LG devices?

In [59]:
merge1 = pd.merge(user_usage,
                  user_device[['use_id', 'platform', 'device']],
                  on='use_id') # by default inner join is used
merge1.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [60]:
# count of `use_id` present in both user_usage and user_device = 159, below code can validate that
user_usage['use_id'].isin(user_device['use_id']).value_counts()

True     159
False     81
Name: use_id, dtype: int64

In [61]:
# merged df should also have 159 records (rows)
merge1.shape

(159, 6)

In [62]:
# Try outer join
outer_merge = pd.merge(user_usage,
                       user_device[['use_id', 'platform', 'device']],
                       on='use_id',
                       how='outer',
                      indicator=True)

# Using `indicator` a new column `_merge` is added which tells from where did that row come, left df, righ df or both
outer_merge.sample(5)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,_merge
52,128.34,1.77,7469.79,22881,android,HTC Desire 825,both
40,74.59,150.59,1038.21,22862,android,HTC One S,both
163,38.56,47.65,4025.86,23083,NaN,NaN,left_only
131,37.27,136.10,1557.33,23005,android,SM-G900F,both
346,NaN,NaN,NaN,23042,android,SM-G900F,right_only

In [63]:
# Solving the problem statement
merge1 = pd.merge(user_usage,
                   user_device[['use_id', 'platform', 'device']],
                   on='use_id',
                   how='left')

merge1.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [64]:
merge1.shape, user_usage.shape

((240, 6), (240, 4))

In [65]:
android_devices.rename(columns={'Retail Branding': 'Manufacturer'}, inplace=True)

android_devices.columns

Index(['Manufacturer', 'Marketing Name', 'Device', 'Model'], dtype='object')

In [66]:
android_devices.head()

  Manufacturer Marketing Name    Device                      Model
0          NaN            NaN    AD681H  Smartfren Andromax AD681H
1          NaN            NaN     FJL21                      FJL21
2          NaN            NaN       T31              Panasonic T31
3          NaN            NaN  hws7721g         MediaPad 7 Youth 2
4           3Q        OC1020A   OC1020A                    OC1020A

In [67]:
merge2 = pd.merge(merge1,
                  android_devices[['Manufacturer', 'Model', 'Marketing Name']],
                  how='left',
                  left_on='device',
                  right_on='Model')

merge2.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,Manufacturer,Model,Marketing Name
0,21.97,4.82,1557.33,22787,android,GT-I9505,Samsung,GT-I9505,Galaxy S4
1,1710.08,136.88,7267.55,22788,android,SM-G930F,Samsung,SM-G930F,Galaxy S7
2,1710.08,136.88,7267.55,22789,android,SM-G930F,Samsung,SM-G930F,Galaxy S7
3,94.46,35.17,519.12,22790,android,D2303,Sony,D2303,Xperia M2
4,71.59,79.26,1557.33,22792,android,SM-G361F,Samsung,SM-G361F,Galaxy Core Prime

In [68]:
merge2.groupby("Manufacturer").agg({
    "outgoing_mins_per_month": "mean",
    "outgoing_sms_per_month": "mean",
    "monthly_mb": "mean",
    "use_id": "count"
})

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id
Manufacturer,,,,
HTC,299.842955,93.059318,5144.077955,44
Huawei,81.526667,9.500000,1561.226667,3
LGE,111.530000,12.760000,1557.330000,2
Lava,60.650000,261.900000,12458.670000,2
Lenovo,215.920000,12.930000,1557.330000,2
Motorola,95.127500,65.666250,3946.500000,16
OnePlus,354.855000,48.330000,6575.410000,6
Samsung,191.010093,92.390463,4017.318889,108
Sony,177.315625,40.176250,3212.000625,16
Vodafone,42.750000,46.830000,5191.120000,1
ZTE,42.750000,46.830000,5191.120000,1

References -<br> https://pbpython.com/pandas_transform.html <br>
https://towardsdatascience.com/when-to-use-pandas-transform-function-df8861aa0dcf <br>
https://drawingfromdata.com/pandas/grouping/pandas-groupby-transform-aggregate-filter.html <br>
https://www.datacamp.com/community/tutorials/joining-dataframes-pandas <br>
https://www.analyticsvidhya.com/blog/2020/02/joins-in-pandas-master-the-different-types-of-joins-in-python/ <br>
https://www.shanelynn.ie/merge-join-dataframes-python-pandas-index-1/ <br>

## Data School - Youtube channel

#### When to use groupby

In [69]:
drinks_data = pd.read_csv("http://bit.ly/drinksbycountry")

In [70]:
drinks_data.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [71]:
# What is the avergae beer servings across all continents

drinks_data.groupby('continent').agg({'beer_servings': 'mean'})

               beer_servings
continent
Africa             61.471698
Asia               37.045455
Europe            193.777778
North America     145.434783
Oceania            89.687500
South America     175.083333

In [72]:
drinks_data.groupby('continent')['beer_servings'].mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [73]:
drinks_data.groupby('continent')['beer_servings'].agg(['mean', 'max', 'min', 'count'])

# Count is specifying how many countries are there in africa

                     mean  max  min  count
continent
Africa          61.471698  376    0     53
Asia            37.045455  247    0     44
Europe         193.777778  361    0     45
North America  145.434783  285    1     23
Oceania         89.687500  306    0     16
South America  175.083333  333   93     12

In [74]:
# If you don't specify coulmn then it would calculate mean across all numeric columns
drinks_data.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333

### Map in Pandas
Map can only be used with Series, where we can `dict` and `Series` as parameters. 

#### Map is used for substituting each value in a series with a different value

In [75]:
d = {v:i for i, v in enumerate(drinks_data['continent'].unique())}

In [76]:
d

{'Asia': 0,
 'Europe': 1,
 'Africa': 2,
 'North America': 3,
 'South America': 4,
 'Oceania': 5}

In [77]:
continent_series = pd.Series(d)

continent_series

Asia             0
Europe           1
Africa           2
North America    3
South America    4
Oceania          5
dtype: int64

In [78]:
# The value taht we want to map, in this case the Continents should the index of dataframe.
drinks_data['continent_num'] = drinks_data['continent'].map(continent_series)

In [79]:
drinks_data.loc[0:4, ['continent', 'continent_num']]

  continent  continent_num
0      Asia              0
1    Europe              1
2    Africa              2
3    Europe              1
4    Africa              2

In [80]:
# Same thing can be done by passing a dictionary, where key should be the value we want to map
drinks_data['continent'].map(d)

0      0
1      1
2      2
3      1
4      2
      ..
188    4
189    0
190    0
191    2
192    2
Name: continent, Length: 193, dtype: int64

In [81]:
drinks_data['continent'].map(len)

0       4
1       6
2       6
3       6
4       6
       ..
188    13
189     4
190     4
191     6
192     6
Name: continent, Length: 193, dtype: int64

### Apply function in Pandas
This can be applied to `Series` as well as `Dataframe`. When applied to `Series` it element wise but when applied on `Dataframe` it will either get applied to Column or Row

In [82]:
drinks_data['continent'].apply(len)

0       4
1       6
2       6
3       6
4       6
       ..
188    13
189     4
190     4
191     6
192     6
Name: continent, Length: 193, dtype: int64

In [83]:
drinks_data.apply(lambda x: x['continent'].upper(), axis=1)

0               ASIA
1             EUROPE
2             AFRICA
3             EUROPE
4             AFRICA
           ...
188    SOUTH AMERICA
189             ASIA
190             ASIA
191           AFRICA
192           AFRICA
Length: 193, dtype: object

In [84]:
# Convert column names to upper case
drinks_data.columns.str.upper()

Index(['COUNTRY', 'BEER_SERVINGS', 'SPIRIT_SERVINGS', 'WINE_SERVINGS',
       'TOTAL_LITRES_OF_PURE_ALCOHOL', 'CONTINENT', 'CONTINENT_NUM'],
      dtype='object')

In [85]:
# Replace underscore with spaces in column names
drinks_data.columns.str.replace("_", " ")

Index(['country', 'beer servings', 'spirit servings', 'wine servings',
       'total litres of pure alcohol', 'continent', 'continent num'],
      dtype='object')

In [86]:
# Rename columns
drinks_data.rename(columns={"country": "Nation"})

,Nation,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
0,Afghanistan,0,0,0,0.0,Asia,0
1,Albania,89,132,54,4.9,Europe,1
2,Algeria,25,0,14,0.7,Africa,2
3,Andorra,245,138,312,12.4,Europe,1
4,Angola,217,57,45,5.9,Africa,2
...,...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America,4
189,Vietnam,111,2,1,2.0,Asia,0
190,Yemen,6,0,0,0.1,Asia,0
191,Zambia,32,19,4,2.5,Africa,2
192,Zimbabwe,64,18,4,4.7,Africa,2

In [87]:
drinks_data.loc[2, ['beer_servings', 'spirit_servings']] = [99, 99]

drinks_data.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
0,Afghanistan,0,0,0,0.0,Asia,0
1,Albania,89,132,54,4.9,Europe,1
2,Algeria,99,99,14,0.7,Africa,2

In [88]:
# this will not work, so use loc when you want to update a single value
drinks_data[drinks_data.country == 'Afghanistan']['beer_servings'] = 11

h:\python\courses\jovian data analysis\venv\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [89]:
drinks_data.loc[drinks_data.country == 'Afghanistan', 'beer_servings'] = 11

drinks_data.loc[drinks_data.country == 'Afghanistan', 'beer_servings']

0    11
Name: beer_servings, dtype: int64

In [108]:
drinks_data.select_dtypes(include='number').apply(lambda x: x.min(), axis=1)

0      0.0
1      1.0
2      0.7
3      1.0
4      2.0
      ...
188    3.0
189    0.0
190    0.0
191    2.0
192    2.0
Length: 193, dtype: float64

In [112]:
drinks_data.apply(lambda x: x.min()) # by default axis=0, so that is that axis that would be changed and 
                                     # columns would remain same, hence the result where min of columns is calculated

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol            0.0
continent                            Africa
continent_num                             0
dtype: object

#### Selecting `dtypes` - use `number` to select numberic dtypes, `integer` to select integer dtypes like int8, int16, int32, int64 and similarly `floating` can also be used.
`drinks_data.select_dtypes(include='number')` <br>
`drinks_data.select_dtypes(include='integer')` <br>
`drinks_data.select_dtypes(include='floating')` <br>
`drinks_data.select_dtypes(include=['integer', 'floating'])` <br>
`drinks_data.select_dtypes(include=['int64', 'float64'])` <br>

In [116]:
drinks_data.select_dtypes(include='number')

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent_num
0,11,0,0,0.0,0
1,89,132,54,4.9,1
2,99,99,14,0.7,2
3,245,138,312,12.4,1
4,217,57,45,5.9,2
...,...,...,...,...,...
188,333,100,3,7.7,4
189,111,2,1,2.0,0
190,6,0,0,0.1,0
191,32,19,4,2.5,2
192,64,18,4,4.7,2

### `applymap` function in Pandas
This can only be applied only to Dataframes and it is applied to all elements of the dataframe.

In [117]:
short_df = drinks_data.head(5).copy() # using copy as we don't want to modify original drinks_data when we make
                                      # change to short_df

In [118]:
short_df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
0,Afghanistan,11,0,0,0.0,Asia,0
1,Albania,89,132,54,4.9,Europe,1
2,Algeria,99,99,14,0.7,Africa,2
3,Andorra,245,138,312,12.4,Europe,1
4,Angola,217,57,45,5.9,Africa,2

In [122]:
# numeric and bool types don't have len attribute hence we filter for dtype
short_df.select_dtypes(include='object').applymap(len)

   country  continent
0       11          4
1        7          6
2        7          6
3        7          6
4        6          6

### Complex Filtering

**For pandas filtering, use `&`, `|` and not `and`, `or` as they are considered ambiguous**

**Another common operation is the use of boolean vectors to filter the data. The operators are: `|` for `or`, `&` for `and`, and `~` for `not`. These must be grouped by using parentheses, since by default Python will evaluate an expression such as `df['A'] > 2 & df['B'] < 3` as `df['A'] > (2 & df['B']) < 3`, while the desired evaluation order is `(df['A'] > 2) & (df['B'] < 3)`.**

Ref - https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#boolean-indexing

In [144]:
filt = (drinks_data['continent']=='Europe') & drinks_data['beer_servings'].between(10, 200) 
# Use this or break it further

In [139]:
filter1 = drinks_data['continent']=='Europe'
filter2 = drinks_data['beer_servings'].between(10, 200)

In [141]:
drinks_data.loc[filter1 & filter2, ['beer_servings', 'country']].head()

    beer_servings             country
1              89             Albania
7              21             Armenia
10             21          Azerbaijan
15            142             Belarus
21             76  Bosnia-Herzegovina

In [143]:
# Above statement can be clubbed into one.
# We use paranthesis before `&` because `&` has more precedence than `==`

drinks_data.loc[(drinks_data['continent']=='Europe') & drinks_data['beer_servings'].between(10, 200), ['beer_servings', 'country']].head()

    beer_servings             country
1              89             Albania
7              21             Armenia
10             21          Azerbaijan
15            142             Belarus
21             76  Bosnia-Herzegovina

In [147]:
drinks_data[drinks_data.country.isin(['Jamaica', 'Thailand'])]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
84,Jamaica,82,97,9,3.4,North America,3
169,Thailand,99,258,1,6.4,Asia,0

In [155]:
drinks_data[drinks_data.country.str.contains('Bu', na=False)] # na=False, don't do anything to NaN values

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
25,Bulgaria,231,252,94,10.3,Europe,1
26,Burkina Faso,25,7,7,4.3,Africa,2
27,Burundi,88,0,0,6.3,Africa,2

In [154]:
drinks_data[drinks_data.country.str.endswith('sia')] # countries that end with `sia`

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num
78,Indonesia,5,1,0,0.1,Asia,0
102,Malaysia,13,4,0,0.3,Asia,0
110,Micronesia,62,50,18,2.3,Oceania,5
175,Tunisia,51,3,20,1.3,Africa,2

In [156]:
drinks_data['temp'] = drinks_data['beer_servings'] + drinks_data['wine_servings']

In [160]:
drinks_data.drop('temp', axis=1, inplace=True) # axis=1 as we want to change the columns
# If we use `columns=['temp']` then axis is  not `required`

# drinks_data.drop(columns=['temp'], inplace=True)

In [161]:
drinks_data.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'continent_num'],
      dtype='object')

In [192]:
drinks_data["temp"] = drinks_data["country"] + "|" + drinks_data["continent"]

In [193]:
drinks_data.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num,temp
0,Afghanistan,11,0,0,0.0,Asia,0,Afghanistan|Asia
1,Albania,89,132,54,4.9,Europe,1,Albania|Europe
2,Algeria,99,99,14,0.7,Africa,2,Algeria|Africa
3,Andorra,245,138,312,12.4,Europe,1,Andorra|Europe
4,Angola,217,57,45,5.9,Africa,2,Angola|Africa

### Let us say we want to make 2 new columns using `temp` column by splitting it on space

#### Option 1: `drinks_data["country1"] = drinks_data["temp"].apply(lambda x: x.split("|")[0])`
#### Option 2: Use `expand` attribute, `drinks_data['temp'].str.split("|", expand=True) `

In [195]:
drinks_data[["country1", "continent1"]] = drinks_data["temp"].str.split("|", expand=True)

### Appending a Dataframe to other

In [197]:
split1 = drinks_data.head(5)
split2 = drinks_data.tail(5)

In [199]:
pd.concat([split1, split2], axis=0, ignore_index=True) # If we use `ignore_index=True` then it automatically adds index

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num,temp,country1,continent1
0,Afghanistan,11,0,0,0.0,Asia,0,Afghanistan|Asia,Afghanistan,Asia
1,Albania,89,132,54,4.9,Europe,1,Albania|Europe,Albania,Europe
2,Algeria,99,99,14,0.7,Africa,2,Algeria|Africa,Algeria,Africa
3,Andorra,245,138,312,12.4,Europe,1,Andorra|Europe,Andorra,Europe
4,Angola,217,57,45,5.9,Africa,2,Angola|Africa,Angola,Africa
5,Venezuela,333,100,3,7.7,South America,4,Venezuela|South America,Venezuela,South America
6,Vietnam,111,2,1,2.0,Asia,0,Vietnam|Asia,Vietnam,Asia
7,Yemen,6,0,0,0.1,Asia,0,Yemen|Asia,Yemen,Asia
8,Zambia,32,19,4,2.5,Africa,2,Zambia|Africa,Zambia,Africa
9,Zimbabwe,64,18,4,4.7,Africa,2,Zimbabwe|Africa,Zimbabwe,Africa

In [201]:
pd.concat([split1, split2], axis=0) # here it preserves the original indexes of both dataframes

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,continent_num,temp,country1,continent1
0,Afghanistan,11,0,0,0.0,Asia,0,Afghanistan|Asia,Afghanistan,Asia
1,Albania,89,132,54,4.9,Europe,1,Albania|Europe,Albania,Europe
2,Algeria,99,99,14,0.7,Africa,2,Algeria|Africa,Algeria,Africa
3,Andorra,245,138,312,12.4,Europe,1,Andorra|Europe,Andorra,Europe
4,Angola,217,57,45,5.9,Africa,2,Angola|Africa,Angola,Africa
188,Venezuela,333,100,3,7.7,South America,4,Venezuela|South America,Venezuela,South America
189,Vietnam,111,2,1,2.0,Asia,0,Vietnam|Asia,Vietnam,Asia
190,Yemen,6,0,0,0.1,Asia,0,Yemen|Asia,Yemen,Asia
191,Zambia,32,19,4,2.5,Africa,2,Zambia|Africa,Zambia,Africa
192,Zimbabwe,64,18,4,4.7,Africa,2,Zimbabwe|Africa,Zimbabwe,Africa